Revit 2027 API
ElectricalAnalyticalNode.CanConnectToUpstreamNode Method
 Verifies that the current node can connect to the upstream node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanConnectToUpstreamNode(
	ElementId upstreamNodeId
)
Public Function CanConnectToUpstreamNode (
	upstreamNodeId As ElementId
) As Boolean
public:
bool CanConnectToUpstreamNode(
	ElementId^ upstreamNodeId
)
member CanConnectToUpstreamNode :
        upstreamNodeId : ElementId -> bool
Parameters
upstreamNodeId ElementId
 The upstream node id.
Return Value
Boolean
 True if the current node can connect to the upstream node.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace